20240206T010954--kdoc-72-org-modeのhtmlエクスポート時に結果だけを表示する方法__draft_code.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 72: org-modeのHTMLエクスポート時に結果だけを表示する方法</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 72: org-modeのHTMLエクスポート時に結果だけを表示する方法</h1>

<div id="outline-container-org1505124" class="outline-2">
<h2 id="org1505124"><a href="#org1505124">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org1505124">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-06 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> 2024-mm-dd &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5a730f1" class="outline-2">
<h2 id="org5a730f1"><a href="#org5a730f1">概要</a></h2>
<div class="outline-text-2" id="text-org5a730f1">
<p>
<a href="20210907012153-org_mode.html#ID-7e85e3f3-a6b9-447e-9826-307a3618dac8">org-mode</a>の機能の1つであるorg-babelでは、コードブロックを評価して結果をテキストに出力できる。これによってコードと結果を楽に残せる。<a href="20210923124913-html.html#ID-9f5b7514-d5e5-4997-81b0-bd453775415c">HTML</a>エクスポート時は結果だけを掲載したいときがある。そのときの書き方をまとめる。
</p>
</div>
</div>
<div id="outline-container-orgd52b99f" class="outline-2">
<h2 id="orgd52b99f"><a href="#orgd52b99f">やりかた</a></h2>
<div class="outline-text-2" id="text-orgd52b99f">
<p>
コマンドを実行して、エクスポート先ではコマンド結果の日付だけを表示したいとする。
</p>

<p>
↓このままだと、<a href="20210923124913-html.html#ID-9f5b7514-d5e5-4997-81b0-bd453775415c">HTML</a>エクスポート時にコードブロックも表示される。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>エクスポート時にコードブロックと評価結果の両方がエクスポートされる</label><pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">+begin_src shell</span>
date
<span class="org-comment-delimiter">#</span><span class="org-comment">+end_src</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">+RESULTS:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">+begin_src</span>
Tue Feb  6 07:55:58 PM JST 2024
<span class="org-comment-delimiter">#</span><span class="org-comment">+end_src</span>
</pre>
</div>

<p>
↓こうする。HTML_HEADをつけてコードブロック本体にCSSをつけて非表示にする。こうすることでHTMLエクスポート時は結果だけ表示されるようになる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>エクスポート時に評価結果だけがエクスポートされる</label><pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">+HTML_HEAD: &lt;style&gt;.src { display: none; }&lt;/style&gt;</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">+begin_src shell</span>
date
<span class="org-comment-delimiter">#</span><span class="org-comment">+end_src</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">+RESULTS:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">+begin_src</span>
Tue Feb  6 07:55:58 PM JST 2024
<span class="org-comment-delimiter">#</span><span class="org-comment">+end_src</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
